---
id: cdfabbfe-4282-40da-9d73-ad6f1f0858b9
longname: Указатели и адресная арифметика 001
languages: [cpp]
tags: [pointers]
checker: cmp_yesno
time_limit: 1
real_time_limit: 1
max_vm_size: 64M
---

Вам нужно написать две функции. 
Первая, now_get_me_some_bytes, выделяет в куче (heap) место под массив из n элементов типа int и возвращает указатель на начало массива. В качестве единственного аргумента она принимает размер массива. Гарантируется, что он будет не меньше единицы.
Вторая, now_free_some_bytes, корректно очищает эту память. В качестве единственного аргумента она принимает указатель на память, которая была выделена при помощи функции now_get_me_some_bytes. 

Обратите внимание, что ответственность за корректный вызов этих функций в нужном порядке ложится на проверяющую программу. Это простая задача, вы можете не писать проверку корректности аргументов и прочую "защиту от дурака". Сосредоточьтесь на корректной работе с памятью.

Для проверки будет использоваться следующий код. Вы можете использовать его для отладки. 

Он считывает размер массива целых чисел с экрана, с помощью вашей функции выделяет под него память, потом считывает с экрана элементы массива, суммирует их и определяет, четное ли получилось число. Вообще-то для решения такой задачи массивы не требуются - здесь этот алгоритм исключительно для того, чтобы проверить, правильно ли выделилась память.

#include <iostream>
using std::cin;
using std::cout;
using std::endl;

int* now_get_me_some_bytes(unsigned int n);
void now_free_some_bytes(int* p);

int main() {
    unsigned int n;
    cin >> n;
    int *a = now_get_me_some_bytes(n);
    for (int i = 0; i < n; i++)
        cin >> a[i];
    int s = 0;
    for (int i = 0; i < n; i++)
        s += a[i];
    if (s % 2)
        cout << "NO" << endl;
    else 
        cout << "YES" << endl;
    now_free_some_bytes(a);
    return 0;
}

В проверяющую программу отправлять только функцию now_get_me_some_bytes. Функцию main и все прочее отправлять не нужно.

### Формат входных данных

В первой строке одно число - размер последовательности.
Во второй строке - последовательность целых чисел соответствующего размера.

### Формат выходных данных

YES, если сумма чисел последовательности четная, и NO, если нет.

### Примеры

```
-> 6
-> 1 2 3 4 5 6
--
<- NO
```

```
-> 1
-> 23456
--
<- YES
```

