---
id: 558aea06-01bb-44c9-af13-f2d9ca68ced2
longname: Реаллокация по-домашнему (второй рецепт)
languages: [cpp]
tags: [pointers]
checker: cmp_int
time_limit: 1
real_time_limit: 1
max_vm_size: 64M
---

Вам нужно написать функцию `void my_slightly_less_dumb_reallocation(int** source, unsigned int n_old, unsigned int n_new)`, которая меняет размер памяти, выделенной под массив целых чисел. Она должна выделить новый кусок памяти нужного размера, перенести туда данные из старого массива, очистить память по старому адресу и изменить указатель на массив.

В качестве аргументов она принимает:

1. Указатель на указатель на массив, память для которого была выделена в куче (heap) при помощи оператора new[]. Обратите внимание, что если вам передали некорректный указатель (`NULL`) любого уровня, функция должна это проверять и не пытаться этот указатель разыменовывать или очищать память по этому адресу.
2. Количество элементов массива на момент вызова функции.
3. Новое количество элементов. Если оно меньше, чем старое, то вы копируете только те элементы, которые влезают, и ничего не выводите на экран. Часть данных потеряется, но это на совести того, кто вашу функцию вызывал. В реальной жизни в таком случае хорошо бы печатать предупреждение, но в формат контеста это не лезет.

Для проверки будет использоваться следующий код. Вы можете использовать его для отладки.

        #include <iostream>
        using std::cin;
        using std::cout;
        using std::endl;

        void my_slightly_less_dumb_reallocation(int** source, unsigned int n_old, unsigned int n_new);

	int main() {
	    unsigned int n, i;
	    cin >> n;
	    int *a = NULL;
	    my_slightly_less_dumb_reallocation(&a, 0, n / 2);
	    for (i = 0; i < n / 2; i++)
	        cin >> a[i];
	    my_slightly_less_dumb_reallocation(&a, n / 2, n);
	    for (; i < n; i++)
	        cin >> a[i];
	    int sum = 0;
	    for (i = 0; i < n; i++)
	        sum += a[i];
	    cout << sum << endl;
	    my_slightly_less_dumb_reallocation(&a, n, n / 2);
	    my_slightly_less_dumb_reallocation(&a, n / 2, 0);
	    my_slightly_less_dumb_reallocation(&a, 0, 0);
	    return 0;
	}


В проверяющую программу отправлять только функцию `my_slightly_less_dumb_reallocation`.

Функцию `main` и все прочее отправлять не нужно.

### Формат входных данных

Первое число n - количество элементов.
Последовательность из n целых чисел.

### Формат выходных данных

Одно число, сумма этой последовательности целых чисел.

### Примеры

```
-> 5
-> 1 2 3 4 5
--
<- 15
```

