---
id: 11e65f1e-3fdb-434d-822e-45d21b3644b7
longname: Указатели и адресная арифметика 002
languages: [cpp]
tags: [pointers]
checker: cmp_yesno
time_limit: 1
real_time_limit: 1
max_vm_size: 64M
---


Вам нужно написать функцию my_personal_swap, которая меняет местами значения двух переменных типа int. В качестве аргументов она принимает два указателя, которые хранят адреса этих переменных. Обратите внимание, что если вам передали некорректные указатели (NULL), функция должна это проверять и не пытаться эти указатели разыменовывать. В этом случае она просто ничего не делает, на экран выводить тоже ничего не нужно.

Для проверки будет использоваться следующий код. Вы можете использовать его для отладки.

```
#include <iostream>
using std::cin;
using std::cout;
using std::endl;

void my_personal_swap(int* a, int* b);

int main() {
    int a, b;
    cin >> a >> b;
    my_personal_swap(&a, &b);
    cout << a << " " << b << endl;
    my_personal_swap(&a, NULL);
    my_personal_swap(NULL, &b);
    my_personal_swap(NULL, NULL);
    return 0;
}
```

В проверяющую программу отправлять только функцию my_personal_swap. Функцию main и все прочее отправлять не нужно.

### Формат входных данных

Последовательность целых чисел.

### Формат выходных данных

Ровно та же последовательность целых чисел.

### Примеры

```
-> 1 2
--
<- 2 1
```

