---
id: 7a7923dc-6e01-4f7e-aade-8d114ccfc8e2
longname: Вычисление массы белка
languages: [cpp, python]
tags: [string]
time_limit: 1
real_time_limit: 1
max_vm_size: 64M
---


В взвешенном алфавите каждому символу присваивается положительное действительное число, называемое весом. Строка, образованная из взвешенного алфавита, называется взвешенной строкой, и ее вес равен сумме весов ее символов.

Стандартный вес, присваиваемый каждому члену аминокислотного алфавита из 20 символов, представляет собой моноизотопную массу соответствующей аминокислоты.

**Примечание:** используйте предоставленную таблицу масс как часть вашего кода.
Вывод ответа с указанной точностью:
С++: `std::cout << std::fixed << std::setprecision(5) << answer;`,
Python: `print('%.5f' % answer)`.
Для C++ не забудьте `#include <iomanip>`.

### Формат входных данных

Белковая нить P длиной не более 1000 а.е.

### Формат выходных данных

Общий вес P с точностью 5 знаков после запятой.

### Примеры

```
-> SKADYEK
--
<- 821.392
```

