---
id: 27e19630-7333-4710-8cc7-837b5b7eea96
longname: Рекурсивный анализ рекурсии
languages: [cpp]
tags: [recursion]
checker: cmp_int
time_limit: 5
real_time_limit: 5
max_vm_size: 64M
---

Дана рекурсия следующего вида:

	void F(int n) {
	        std::cout << n;
	        if (n >= 3) {
	                F(n / 2);
	                F(n - 1);
	        }
	}


Выведите на экран сумму всех чисел, которые выводятся данной рекурсией.

Число n вводится с клавиатуры.

### Формат входных данных

На вход подается целое число n в диапазоне от -455 до 455

### Формат выходных данных

Одно число — сумма всех выводимых чисел фунуцией  void F(int n).

### Примеры

```
-> 3
--
<- 6
```

```
-> 6
--
<- 31
```

```
-> -5
--
<- -5
```
